In [36]:
import pandas as pd

In [37]:
df = pd.read_excel("example_data_cleaning.xlsx")
df.head()

   TransactionID  ClientID    BirthYear   Amount Profession  Department  Risk
0              4     34985  1923.000000     5670    manager          78   Low
1             16     34997  1923.000000  2399090  developer          78  High
2             25     35006  1923.000000    33050         HR          78  High
3             12     34993  1939.142857    23430  professor          78   Low
4             21     35002  1939.142857    16770    manager          78   Low

In [ ]:
null_columns = df.isnull().sum()
null_columns

In [ ]:
df['BirthYear']= df['BirthYear'].fillna(0)
df['BirthYear'] = df['BirthYear'].astype('int64')
df

In [ ]:
df['Profession']= df['Profession'].fillna("Not Specified")
df

In [45]:
df['Profession'] = df['Profession'].str.replace('etudient', 'Student')

# Capitalize the values in the profession column.
df['Profession'] = df['Profession'].str.capitalize()
df.head()

   TransactionID  ClientID  BirthYear   Amount Profession  Department  Risk
0              4     34985       1923     5670    Manager          78   Low
1             16     34997       1923  2399090  Developer          78  High
2             25     35006       1923    33050         Hr          78  High
3             12     34993       1939    23430  Professor          78   Low
4             21     35002       1939    16770    Manager          78   Low

In [46]:
len(df)

30

In [48]:
# Removing duplicates
df = df.drop_duplicates()
len(df)
# No duplicates found.

30